friends/app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    # @friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 7]]
---
  def destroy
    @friend.destroy!